### CIS3120 Homework 2
- Due by April 1st 
- Submit through the blackboard link
- Submit with the notebook file (.ipynb)

1. Create a Pandas DataFrame from the following lists and set 'labels' as index of this DataFrame. (5 points)

name = ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'] <br>
score = [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19] <br>
attempts = [1, 3, 2, 3, 2, 3, 1, 1, 2, 1] <br>
qualify = ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] <br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [3]:


#Expected output

In [4]:
import pandas as pd
import numpy as np

name = ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas']
score = [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19]
attempts = [1, 3, 2, 3, 2, 3, 1, 1, 2, 1]
qualify = ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(list(zip(name, score, attempts, qualify)), columns=['name', 'score', 'attempts','qualify'], index= labels )
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Complete the following questions based on the DataFrame you have created from the previous question (#1) (40 points)

1.1 Get the first 3 rows from the DataFrame, and save selected data in a new dataframe.  (5 points)

1.2 Select the rows where the number of attempts in the examination is less than 2 and score greater than 15. (10 points)

1.3 Find students whose score are missing (i.e. is NaN) and the number of attempts they have done. (15 points)

1.4 Find average number of attempts for qualified students and not qualified students. (10 points)

In [5]:
# 1.1 Get the first 3 rows from the DataFrame, and save selected data in a new dataframe.  (5 points)

# using iloc to get the top 3 rows of the df dataframe
#df.iloc[0:3]

top_3 = df.iloc[0:3]
top_3

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [6]:
# 1.2 Select the rows where the number of attempts in the examination is less than 2 and score greater than 15. (10 points)

#df
df[(df['attempts'] < 2) & (df['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [7]:
# 1.3 Find students whose score are missing (i.e. is NaN) and the number of attempts they have done. (15 points)

df[df['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [8]:
# 1.4 Find average number of attempts for qualified students and not qualified students. (10 points)

df_qual = df[(df['qualify'] == 'yes')]
df_unqual = df[(df['qualify'] == 'no')]

In [9]:
df_qual

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
j      Jonas   19.0         1     yes

In [10]:
df_qual['attempts'].mean()
# Average for qualified students is 1.6 attempts

1.6

In [11]:
df_unqual['attempts'].mean()
# Average for non-qualified students is 2.2 attempts

2.2

2. Create a Pandas DataFrame with following lists. (5 points)

ord_no = [70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013] <br>
purch_amt = [150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6] <br>
ord_date = ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10',
'2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'] <br>
customer_id'= [3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001] <br>
salesman_id' = [5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan] <br>

In [12]:
ord_no = [70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013]
purch_amt = [150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6]
ord_date = ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25']
customer_id = [3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001]
salesman_id  = [5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]

In [13]:
# loading up the dataframe with the lists, naming columns

df_2 = pd.DataFrame(list(zip(ord_no, purch_amt, ord_date, customer_id, salesman_id)),
                    columns=['ord_no', 'purch_amt', 'ord_date', 'customer_id', 'salesman_id'])
df_2

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

In [14]:


#Expected output

Complete the following questions based on the DataFrame you have created from the previous question (#2) (50 points)

2.1 Detect missing values of the DataFrame created from #2. Display True or False. (5 points)

2.2 Identify the column(s) of the DataFrame which have at least one missing value. (5 points)

2.3 Count the number of missing values in each column of the DataFrame. (5 points)

2.4 Delete the row(s) of the DataFrame which have missing values in the column 'salesman_id'; replace all NAs in the column 'ord_no' with 0; replace the NA in the column 'ord_date' with value from the previous row. (15 points)

2.5 Group the DataFrame by salesman and calculate each salesman's minimum, maximum and mean sales amount. (10 points)

2.6 Create a pivot table and find the total sale amount salesman wise and order date wise. (10 points)

In [15]:
# 2.1 Detect missing values of the DataFrame created from #2. Display True or False. (5 points)
# check to see what values are na in all column
df_2.isna()

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True

In [16]:
# 2.2 Identify the column(s) of the DataFrame which have at least one missing value. (5 points)
# check if any column has na values
print(df_2.isna().any())

ord_no          True
purch_amt      False
ord_date        True
customer_id    False
salesman_id     True
dtype: bool

In [17]:
# 2.3 Count the number of missing values in each column of the DataFrame. (5 points)

print(df_2.isna().sum())

ord_no         4
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

In [27]:
# 2.4 Delete the row(s) of the DataFrame which have missing values in the column 'salesman_id';
# replace all NAs in the column 'ord_no' with 0;
# replace the NA in the column 'ord_date' with value from the previous row. (15 points)

df_2

In [19]:
# Delete the row(s) of the DataFrame which have missing values in the column 'salesman_id'
df_2.dropna(how= 'any',subset= ['salesman_id'])

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0

In [31]:
# replace all NAs in the column 'ord_no' with 0;

df_2['ord_no'] = df_2['ord_no'].fillna(0)
df_2

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       0.0     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26  2012-09-10         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       0.0     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       0.0    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      0.0      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

In [21]:
# replace the NA in the column 'ord_date' with value from the previous row. (15 points)

df_2['ord_date'] = df_2['ord_date'].fillna(method = 'pad')
df_2

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       0.0     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26  2012-09-10         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       0.0     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       0.0    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      0.0      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

In [22]:
# 2.5 Group the DataFrame by salesman and calculate each salesman's minimum, maximum and mean sales amount. (10 points)

df_2.groupby(['salesman_id']).agg({'purch_amt': [min, max, np.mean]})

            purch_amt
                  min     max         mean
salesman_id
5001.0          65.26  5760.0  2741.953333
5002.0         150.50   948.5   449.816667
5003.0          75.29  2480.4   942.113333

In [23]:
# 2.6 Create a pivot table;
# find the total sale amount salesman wise and order date wise.

df_2.pivot_table('purch_amt', index = ['ord_date', 'salesman_id'])

                        purch_amt
ord_date   salesman_id
2012-06-27 5002.0          250.45
2012-07-27 5001.0         2400.60
2012-08-17 5003.0           75.29
2012-09-10 5001.0         2912.63
           5002.0          948.50
           5003.0          270.65
2012-10-05 5002.0          150.50
2012-10-10 5003.0         2480.40